    {  
        "CityCode": [  
            {  
                "Province": "北京",  
                "City": [  
                    {  
                        "Name": "北京",  
                        "Code": "101010100"  
                    },  
                    {  
                        "Name": "朝阳",  
                        "Code": "101010300"  
                    },  
                    {  
                        "Name": "顺义",  
                        "Code": "101010400"  
                    },  
                    {  
                        "Name": "怀柔",  
                        "Code": "101010500"  
                    },  
                    {  
                        "Name": "通州",  
                        "Code": "101010600"  
                    },  
                    {  
                        "Name": "昌平",  
                        "Code": "101010700"  
                    },  
                    {  
                        "Name": "延庆",  
                        "Code": "101010800"  
                    },  
                    {  
                        "Name": "丰台",  
                        "Code": "101010900"  
                    },  
                    {  
                        "Name": "石景山",  
                        "Code": "101011000"  
                    },  
                    {  
                        "Name": "大兴",  
                        "Code": "101011100"  
                    },  
                    {  
                        "Name": "房山",  
                        "Code": "101011200"  
                    },  
                    {  
                        "Name": "密云",  
                        "Code": "101011300"  
                    },  
                    {  
                        "Name": "门头沟",  
                        "Code": "101011400"  
                    },  
                    {  
                        "Name": "平谷",  
                        "Code": "101011500"  
                    },  
                    {  
                        "Name": "八达岭",  
                        "Code": "101011600"  
                    },  
                    {  
                        "Name": "佛爷顶",  
                        "Code": "101011700"  
                    },  
                    {  
                        "Name": "汤河口",  
                        "Code": "101011800"  
                    },  
                    {  
                        "Name": "密云上甸子",  
                        "Code": "101011900"  
                    },  
                    {  
                        "Name": "斋堂",  
                        "Code": "101012000"  
                    },  
                    {  
                        "Name": "霞云岭",  
                        "Code": "101012100"  
                    },  
                    {  
                        "Name": "北京城区",  
                        "Code": "101012200"  
                    },  
                    {  
                        "Name": "海淀",  
                        "Code": "101010200"  
                    }  
                ]  
            },  
            {  
                "Province": "天津",  
                "City": [  
                    {  
                        "Name": "天津",  
                        "Code": "101030100"  
                    },  
                    {  
                        "Name": "宝坻",  
                        "Code": "101030300"  
                    },  
                    {  
                        "Name": "东丽",  
                        "Code": "101030400"  
                    },  
                    {  
                        "Name": "西青",  
                        "Code": "101030500"  
                    },  
                    {  
                        "Name": "北辰",  
                        "Code": "101030600"  
                    },  
                    {  
                        "Name": "蓟县",  
                        "Code": "101031400"  
                    },  
                    {  
                        "Name": "汉沽",  
                        "Code": "101030800"  
                    },  
                    {  
                        "Name": "静海",  
                        "Code": "101030900"  
                    },  
                    {  
                        "Name": "津南",  
                        "Code": "101031000"  
                    },  
                    {  
                        "Name": "塘沽",  
                        "Code": "101031100"  
                    },  
                    {  
                        "Name": "大港",  
                        "Code": "101031200"  
                    },  
                    {  
                        "Name": "武清",  
                        "Code": "101030200"  
                    },  
                    {  
                        "Name": "宁河",  
                        "Code": "101030700"  
                    }  
                ]  
            },  
            {  
                "Province": "上海",  
                "City": [  
                    {  
                        "Name": "上海",  
                        "Code": "101020100"  
                    },  
                    {  
                        "Name": "宝山",  
                        "Code": "101020300"  
                    },  
                    {  
                        "Name": "嘉定",  
                        "Code": "101020500"  
                    },  
                    {  
                        "Name": "南汇",  
                        "Code": "101020600"  
                    },  
                    {  
                        "Name": "浦东",  
                        "Code": "101021300"  
                    },  
                    {  
                        "Name": "青浦",  
                        "Code": "101020800"  
                    },  
                    {  
                        "Name": "松江",  
                        "Code": "101020900"  
                    },  
                    {  
                        "Name": "奉贤",  
                        "Code": "101021000"  
                    },  
                    {  
                        "Name": "崇明",  
                        "Code": "101021100"  
                    },  
                    {  
                        "Name": "徐家汇",  
                        "Code": "101021200"  
                    },  
                    {  
                        "Name": "闵行",  
                        "Code": "101020200"  
                    },  
                    {  
                        "Name": "金山",  
                        "Code": "101020700"  
                    }  
                ]  
            },  
            {  
                "Province": "河北",  
                "City": [  
                    {  
                        "Name": "石家庄",  
                        "Code": "101090101"  
                    },  
                    {  
                        "Name": "张家口",  
                        "Code": "101090301"  
                    },  
                    {  
                        "Name": "承德",  
                        "Code": "101090402"  
                    },  
                    {  
                        "Name": "唐山",  
                        "Code": "101090501"  
                    },  
                    {  
                        "Name": "秦皇岛",  
                        "Code": "101091101"  
                    },  
                    {  
                        "Name": "沧州",  
                        "Code": "101090701"  
                    },  
                    {  
                        "Name": "衡水",  
                        "Code": "101090801"  
                    },  
                    {  
                        "Name": "邢台",  
                        "Code": "101090901"  
                    },  
                    {  
                        "Name": "邯郸",  
                        "Code": "101091001"  
                    },  
                    {  
                        "Name": "保定",  
                        "Code": "101090201"  
                    },  
                    {  
                        "Name": "廊坊",  
                        "Code": "101090601"  
                    }  
                ]  
            },  
            {  
                "Province": "河南",  
                "City": [  
                    {  
                        "Name": "郑州",  
                        "Code": "101180101"  
                    },  
                    {  
                        "Name": "新乡",  
                        "Code": "101180301"  
                    },  
                    {  
                        "Name": "许昌",  
                        "Code": "101180401"  
                    },  
                    {  
                        "Name": "平顶山",  
                        "Code": "101180501"  
                    },  
                    {  
                        "Name": "信阳",  
                        "Code": "101180601"  
                    },  
                    {  
                        "Name": "南阳",  
                        "Code": "101180701"  
                    },  
                    {  
                        "Name": "开封",  
                        "Code": "101180801"  
                    },  
                    {  
                        "Name": "洛阳",  
                        "Code": "101180901"  
                    },  
                    {  
                        "Name": "商丘",  
                        "Code": "101181001"  
                    },  
                    {  
                        "Name": "焦作",  
                        "Code": "101181101"  
                    },  
                    {  
                        "Name": "鹤壁",  
                        "Code": "101181201"  
                    },  
                    {  
                        "Name": "濮阳",  
                        "Code": "101181301"  
                    },  
                    {  
                        "Name": "周口",  
                        "Code": "101181401"  
                    },  
                    {  
                        "Name": "漯河",  
                        "Code": "101181501"  
                    },  
                    {  
                        "Name": "驻马店",  
                        "Code": "101181601"  
                    },  
                    {  
                        "Name": "三门峡",  
                        "Code": "101181701"  
                    },  
                    {  
                        "Name": "济源",  
                        "Code": "101181801"  
                    },  
                    {  
                        "Name": "安阳",  
                        "Code": "101180201"  
                    }  
                ]  
            },  
            {  
                "Province": "安徽",  
                "City": [  
                    {  
                        "Name": "合肥",  
                        "Code": "101220101"  
                    },  
                    {  
                        "Name": "芜湖",  
                        "Code": "101220301"  
                    },  
                    {  
                        "Name": "淮南",  
                        "Code": "101220401"  
                    },  
                    {  
                        "Name": "马鞍山",  
                        "Code": "101220501"  
                    },  
                    {  
                        "Name": "安庆",  
                        "Code": "101220601"  
                    },  
                    {  
                        "Name": "宿州",  
                        "Code": "101220701"  
                    },  
                    {  
                        "Name": "阜阳",  
                        "Code": "101220801"  
                    },  
                    {  
                        "Name": "亳州",  
                        "Code": "101220901"  
                    },  
                    {  
                        "Name": "黄山",  
                        "Code": "101221001"  
                    },  
                    {  
                        "Name": "滁州",  
                        "Code": "101221101"  
                    },  
                    {  
                        "Name": "淮北",  
                        "Code": "101221201"  
                    },  
                    {  
                        "Name": "铜陵",  
                        "Code": "101221301"  
                    },  
                    {  
                        "Name": "宣城",  
                        "Code": "101221401"  
                    },  
                    {  
                        "Name": "六安",  
                        "Code": "101221501"  
                    },  
                    {  
                        "Name": "巢湖",  
                        "Code": "101221601"  
                    },  
                    {  
                        "Name": "池州",  
                        "Code": "101221701"  
                    },  
                    {  
                        "Name": "蚌埠",  
                        "Code": "101220201"  
                    }  
                ]  
            },  
            {  
                "Province": "浙江",  
                "City": [  
                    {  
                        "Name": "杭州",  
                        "Code": "101210101"  
                    },  
                    {  
                        "Name": "舟山",  
                        "Code": "101211101"  
                    },  
                    {  
                        "Name": "湖州",  
                        "Code": "101210201"  
                    },  
                    {  
                        "Name": "嘉兴",  
                        "Code": "101210301"  
                    },  
                    {  
                        "Name": "金华",  
                        "Code": "101210901"  
                    },  
                    {  
                        "Name": "绍兴",  
                        "Code": "101210501"  
                    },  
                    {  
                        "Name": "台州",  
                        "Code": "101210601"  
                    },  
                    {  
                        "Name": "温州",  
                        "Code": "101210701"  
                    },  
                    {  
                        "Name": "丽水",  
                        "Code": "101210801"  
                    },  
                    {  
                        "Name": "衢州",  
                        "Code": "101211001"  
                    },  
                    {  
                        "Name": "宁波",  
                        "Code": "101210401"  
                    }  
                ]  
            },  
            {  
                "Province": "重庆",  
                "City": [  
                    {  
                        "Name": "重庆",  
                        "Code": "101040100"  
                    },  
                    {  
                        "Name": "合川",  
                        "Code": "101040300"  
                    },  
                    {  
                        "Name": "南川",  
                        "Code": "101040400"  
                    },  
                    {  
                        "Name": "江津",  
                        "Code": "101040500"  
                    },  
                    {  
                        "Name": "万盛",  
                        "Code": "101040600"  
                    },  
                    {  
                        "Name": "渝北",  
                        "Code": "101040700"  
                    },  
                    {  
                        "Name": "北碚",  
                        "Code": "101040800"  
                    },  
                    {  
                        "Name": "巴南",  
                        "Code": "101040900"  
                    },  
                    {  
                        "Name": "长寿",  
                        "Code": "101041000"  
                    },  
                    {  
                        "Name": "黔江",  
                        "Code": "101041100"  
                    },  
                    {  
                        "Name": "万州天城",  
                        "Code": "101041200"  
                    },  
                    {  
                        "Name": "万州龙宝",  
                        "Code": "101041300"  
                    },  
                    {  
                        "Name": "涪陵",  
                        "Code": "101041400"  
                    },  
                    {  
                        "Name": "开县",  
                        "Code": "101041500"  
                    },  
                    {  
                        "Name": "城口",  
                        "Code": "101041600"  
                    },  
                    {  
                        "Name": "云阳",  
                        "Code": "101041700"  
                    },  
                    {  
                        "Name": "巫溪",  
                        "Code": "101041800"  
                    },  
                    {  
                        "Name": "奉节",  
                        "Code": "101041900"  
                    },  
                    {  
                        "Name": "巫山",  
                        "Code": "101042000"  
                    },  
                    {  
                        "Name": "潼南",  
                        "Code": "101042100"  
                    },  
                    {  
                        "Name": "垫江",  
                        "Code": "101042200"  
                    },  
                    {  
                        "Name": "梁平",  
                        "Code": "101042300"  
                    },  
                    {  
                        "Name": "忠县",  
                        "Code": "101042400"  
                    },  
                    {  
                        "Name": "石柱",  
                        "Code": "101042500"  
                    },  
                    {  
                        "Name": "大足",  
                        "Code": "101042600"  
                    },  
                    {  
                        "Name": "荣昌",  
                        "Code": "101042700"  
                    },  
                    {  
                        "Name": "铜梁",  
                        "Code": "101042800"  
                    },  
                    {  
                        "Name": "璧山",  
                        "Code": "101042900"  
                    },  
                    {  
                        "Name": "丰都",  
                        "Code": "101043000"  
                    },  
                    {  
                        "Name": "武隆",  
                        "Code": "101043100"  
                    },  
                    {  
                        "Name": "彭水",  
                        "Code": "101043200"  
                    },  
                    {  
                        "Name": "綦江",  
                        "Code": "101043300"  
                    },  
                    {  
                        "Name": "酉阳",  
                        "Code": "101043400"  
                    },  
                    {  
                        "Name": "秀山",  
                        "Code": "101043600"  
                    },  
                    {  
                        "Name": "沙坪坝",  
                        "Code": "101043700"  
                    },  
                    {  
                        "Name": "永川",  
                        "Code": "101040200"  
                    }  
                ]  
            },  
            {  
                "Province": "福建",  
                "City": [  
                    {  
                        "Name": "福州",  
                        "Code": "101230101"  
                    },  
                    {  
                        "Name": "泉州",  
                        "Code": "101230501"  
                    },  
                    {  
                        "Name": "漳州",  
                        "Code": "101230601"  
                    },  
                    {  
                        "Name": "龙岩",  
                        "Code": "101230701"  
                    },  
                    {  
                        "Name": "晋江",  
                        "Code": "101230509"  
                    },  
                    {  
                        "Name": "南平",  
                        "Code": "101230901"  
                    },  
                    {  
                        "Name": "厦门",  
                        "Code": "101230201"  
                    },  
                    {  
                        "Name": "宁德",  
                        "Code": "101230301"  
                    },  
                    {  
                        "Name": "莆田",  
                        "Code": "101230401"  
                    },  
                    {  
                        "Name": "三明",  
                        "Code": "101230801"  
                    }  
                ]  
            },  
            {  
                "Province": "甘肃",  
                "City": [  
                    {  
                        "Name": "兰州",  
                        "Code": "101160101"  
                    },  
                    {  
                        "Name": "平凉",  
                        "Code": "101160301"  
                    },  
                    {  
                        "Name": "庆阳",  
                        "Code": "101160401"  
                    },  
                    {  
                        "Name": "武威",  
                        "Code": "101160501"  
                    },  
                    {  
                        "Name": "金昌",  
                        "Code": "101160601"  
                    },  
                    {  
                        "Name": "嘉峪关",  
                        "Code": "101161401"  
                    },  
                    {  
                        "Name": "酒泉",  
                        "Code": "101160801"  
                    },  
                    {  
                        "Name": "天水",  
                        "Code": "101160901"  
                    },  
                    {  
                        "Name": "武都",  
                        "Code": "101161001"  
                    },  
                    {  
                        "Name": "临夏",  
                        "Code": "101161101"  
                    },  
                    {  
                        "Name": "合作",  
                        "Code": "101161201"  
                    },  
                    {  
                        "Name": "白银",  
                        "Code": "101161301"  
                    },  
                    {  
                        "Name": "定西",  
                        "Code": "101160201"  
                    },  
                    {  
                        "Name": "张掖",  
                        "Code": "101160701"  
                    }  
                ]  
            },  
            {  
                "Province": "广东",  
                "City": [  
                    {  
                        "Name": "广州",  
                        "Code": "101280101"  
                    },  
                    {  
                        "Name": "惠州",  
                        "Code": "101280301"  
                    },  
                    {  
                        "Name": "梅州",  
                        "Code": "101280401"  
                    },  
                    {  
                        "Name": "汕头",  
                        "Code": "101280501"  
                    },  
                    {  
                        "Name": "深圳",  
                        "Code": "101280601"  
                    },  
                    {  
                        "Name": "珠海",  
                        "Code": "101280701"  
                    },  
                    {  
                        "Name": "佛山",  
                        "Code": "101280800"  
                    },  
                    {  
                        "Name": "肇庆",  
                        "Code": "101280901"  
                    },  
                    {  
                        "Name": "湛江",  
                        "Code": "101281001"  
                    },  
                    {  
                        "Name": "江门",  
                        "Code": "101281101"  
                    },  
                    {  
                        "Name": "河源",  
                        "Code": "101281201"  
                    },  
                    {  
                        "Name": "清远",  
                        "Code": "101281301"  
                    },  
                    {  
                        "Name": "云浮",  
                        "Code": "101281401"  
                    },  
                    {  
                        "Name": "潮州",  
                        "Code": "101281501"  
                    },  
                    {  
                        "Name": "东莞",  
                        "Code": "101281601"  
                    },  
                    {  
                        "Name": "中山",  
                        "Code": "101281701"  
                    },  
                    {  
                        "Name": "阳江",  
                        "Code": "101281801"  
                    },  
                    {  
                        "Name": "揭阳",  
                        "Code": "101281901"  
                    },  
                    {  
                        "Name": "茂名",  
                        "Code": "101282001"  
                    },  
                    {  
                        "Name": "汕尾",  
                        "Code": "101282101"  
                    },  
                    {  
                        "Name": "韶关",  
                        "Code": "101280201"  
                    }  
                ]  
            },  
            {  
                "Province": "广西",  
                "City": [  
                    {  
                        "Name": "南宁",  
                        "Code": "101300101"  
                    },  
                    {  
                        "Name": "柳州",  
                        "Code": "101300301"  
                    },  
                    {  
                        "Name": "来宾",  
                        "Code": "101300401"  
                    },  
                    {  
                        "Name": "桂林",  
                        "Code": "101300501"  
                    },  
                    {  
                        "Name": "梧州",  
                        "Code": "101300601"  
                    },  
                    {  
                        "Name": "防城港",  
                        "Code": "101301401"  
                    },  
                    {  
                        "Name": "贵港",  
                        "Code": "101300801"  
                    },  
                    {  
                        "Name": "玉林",  
                        "Code": "101300901"  
                    },  
                    {  
                        "Name": "百色",  
                        "Code": "101301001"  
                    },  
                    {  
                        "Name": "钦州",  
                        "Code": "101301101"  
                    },  
                    {  
                        "Name": "河池",  
                        "Code": "101301201"  
                    },  
                    {  
                        "Name": "北海",  
                        "Code": "101301301"  
                    },  
                    {  
                        "Name": "崇左",  
                        "Code": "101300201"  
                    },  
                    {  
                        "Name": "贺州",  
                        "Code": "101300701"  
                    }  
                ]  
            },  
            {  
                "Province": "贵州",  
                "City": [  
                    {  
                        "Name": "贵阳",  
                        "Code": "101260101"  
                    },  
                    {  
                        "Name": "安顺",  
                        "Code": "101260301"  
                    },  
                    {  
                        "Name": "都匀",  
                        "Code": "101260401"  
                    },  
                    {  
                        "Name": "兴义",  
                        "Code": "101260906"  
                    },  
                    {  
                        "Name": "铜仁",  
                        "Code": "101260601"  
                    },  
                    {  
                        "Name": "毕节",  
                        "Code": "101260701"  
                    },  
                    {  
                        "Name": "六盘水",  
                        "Code": "101260801"  
                    },  
                    {  
                        "Name": "遵义",  
                        "Code": "101260201"  
                    },  
                    {  
                        "Name": "凯里",  
                        "Code": "101260501"  
                    }  
                ]  
            },  
            {  
                "Province": "云南",  
                "City": [  
                    {  
                        "Name": "昆明",  
                        "Code": "101290101"  
                    },  
                    {  
                        "Name": "红河",  
                        "Code": "101290301"  
                    },  
                    {  
                        "Name": "文山",  
                        "Code": "101290601"  
                    },  
                    {  
                        "Name": "玉溪",  
                        "Code": "101290701"  
                    },  
                    {  
                        "Name": "楚雄",  
                        "Code": "101290801"  
                    },  
                    {  
                        "Name": "普洱",  
                        "Code": "101290901"  
                    },  
                    {  
                        "Name": "昭通",  
                        "Code": "101291001"  
                    },  
                    {  
                        "Name": "临沧",  
                        "Code": "101291101"  
                    },  
                    {  
                        "Name": "怒江",  
                        "Code": "101291201"  
                    },  
                    {  
                        "Name": "香格里拉",  
                        "Code": "101291301"  
                    },  
                    {  
                        "Name": "丽江",  
                        "Code": "101291401"  
                    },  
                    {  
                        "Name": "德宏",  
                        "Code": "101291501"  
                    },  
                    {  
                        "Name": "景洪",  
                        "Code": "101291601"  
                    },  
                    {  
                        "Name": "大理",  
                        "Code": "101290201"  
                    },  
                    {  
                        "Name": "曲靖",  
                        "Code": "101290401"  
                    },  
                    {  
                        "Name": "保山",  
                        "Code": "101290501"  
                    }  
                ]  
            },  
            {  
                "Province": "内蒙古",  
                "City": [  
                    {  
                        "Name": "呼和浩特",  
                        "Code": "101080101"  
                    },  
                    {  
                        "Name": "乌海",  
                        "Code": "101080301"  
                    },  
                    {  
                        "Name": "集宁",  
                        "Code": "101080401"  
                    },  
                    {  
                        "Name": "通辽",  
                        "Code": "101080501"  
                    },  
                    {  
                        "Name": "阿拉善左旗",  
                        "Code": "101081201"  
                    },  
                    {  
                        "Name": "鄂尔多斯",  
                        "Code": "101080701"  
                    },  
                    {  
                        "Name": "临河",  
                        "Code": "101080801"  
                    },  
                    {  
                        "Name": "锡林浩特",  
                        "Code": "101080901"  
                    },  
                    {  
                        "Name": "呼伦贝尔",  
                        "Code": "101081000"  
                    },  
                    {  
                        "Name": "乌兰浩特",  
                        "Code": "101081101"  
                    },  
                    {  
                        "Name": "包头",  
                        "Code": "101080201"  
                    },  
                    {  
                        "Name": "赤峰",  
                        "Code": "101080601"  
                    }  
                ]  
            },  
            {  
                "Province": "江西",  
                "City": [  
                    {  
                        "Name": "南昌",  
                        "Code": "101240101"  
                    },  
                    {  
                        "Name": "上饶",  
                        "Code": "101240301"  
                    },  
                    {  
                        "Name": "抚州",  
                        "Code": "101240401"  
                    },  
                    {  
                        "Name": "宜春",  
                        "Code": "101240501"  
                    },  
                    {  
                        "Name": "鹰潭",  
                        "Code": "101241101"  
                    },  
                    {  
                        "Name": "赣州",  
                        "Code": "101240701"  
                    },  
                    {  
                        "Name": "景德镇",  
                        "Code": "101240801"  
                    },  
                    {  
                        "Name": "萍乡",  
                        "Code": "101240901"  
                    },  
                    {  
                        "Name": "新余",  
                        "Code": "101241001"  
                    },  
                    {  
                        "Name": "九江",  
                        "Code": "101240201"  
                    },  
                    {  
                        "Name": "吉安",  
                        "Code": "101240601"  
                    }  
                ]  
            },  
            {  
                "Province": "湖北",  
                "City": [  
                    {  
                        "Name": "武汉",  
                        "Code": "101200101"  
                    },  
                    {  
                        "Name": "黄冈",  
                        "Code": "101200501"  
                    },  
                    {  
                        "Name": "荆州",  
                        "Code": "101200801"  
                    },  
                    {  
                        "Name": "宜昌",  
                        "Code": "101200901"  
                    },  
                    {  
                        "Name": "恩施",  
                        "Code": "101201001"  
                    },  
                    {  
                        "Name": "十堰",  
                        "Code": "101201101"  
                    },  
                    {  
                        "Name": "神农架",  
                        "Code": "101201201"  
                    },  
                    {  
                        "Name": "随州",  
                        "Code": "101201301"  
                    },  
                    {  
                        "Name": "荆门",  
                        "Code": "101201401"  
                    },  
                    {  
                        "Name": "天门",  
                        "Code": "101201501"  
                    },  
                    {  
                        "Name": "仙桃",  
                        "Code": "101201601"  
                    },  
                    {  
                        "Name": "潜江",  
                        "Code": "101201701"  
                    },  
                    {  
                        "Name": "襄樊",  
                        "Code": "101200201"  
                    },  
                    {  
                        "Name": "鄂州",  
                        "Code": "101200301"  
                    },  
                    {  
                        "Name": "孝感",  
                        "Code": "101200401"  
                    },  
                    {  
                        "Name": "黄石",  
                        "Code": "101200601"  
                    },  
                    {  
                        "Name": "咸宁",  
                        "Code": "101200701"  
                    }  
                ]  
            },  
            {  
                "Province": "四川",  
                "City": [  
                    {  
                        "Name": "成都",  
                        "Code": "101270101"  
                    },  
                    {  
                        "Name": "自贡",  
                        "Code": "101270301"  
                    },  
                    {  
                        "Name": "绵阳",  
                        "Code": "101270401"  
                    },  
                    {  
                        "Name": "南充",  
                        "Code": "101270501"  
                    },  
                    {  
                        "Name": "达州",  
                        "Code": "101270601"  
                    },  
                    {  
                        "Name": "遂宁",  
                        "Code": "101270701"  
                    },  
                    {  
                        "Name": "广安",  
                        "Code": "101270801"  
                    },  
                    {  
                        "Name": "巴中",  
                        "Code": "101270901"  
                    },  
                    {  
                        "Name": "泸州",  
                        "Code": "101271001"  
                    },  
                    {  
                        "Name": "宜宾",  
                        "Code": "101271101"  
                    },  
                    {  
                        "Name": "内江",  
                        "Code": "101271201"  
                    },  
                    {  
                        "Name": "资阳",  
                        "Code": "101271301"  
                    },  
                    {  
                        "Name": "乐山",  
                        "Code": "101271401"  
                    },  
                    {  
                        "Name": "眉山",  
                        "Code": "101271501"  
                    },  
                    {  
                        "Name": "凉山",  
                        "Code": "101271601"  
                    },  
                    {  
                        "Name": "雅安",  
                        "Code": "101271701"  
                    },  
                    {  
                        "Name": "甘孜",  
                        "Code": "101271801"  
                    },  
                    {  
                        "Name": "阿坝",  
                        "Code": "101271901"  
                    },  
                    {  
                        "Name": "德阳",  
                        "Code": "101272001"  
                    },  
                    {  
                        "Name": "广元",  
                        "Code": "101272101"  
                    },  
                    {  
                        "Name": "攀枝花",  
                        "Code": "101270201"  
                    }  
                ]  
            },  
            {  
                "Province": "宁夏",  
                "City": [  
                    {  
                        "Name": "银川",  
                        "Code": "101170101"  
                    },  
                    {  
                        "Name": "中卫",  
                        "Code": "101170501"  
                    },  
                    {  
                        "Name": "固原",  
                        "Code": "101170401"  
                    },  
                    {  
                        "Name": "石嘴山",  
                        "Code": "101170201"  
                    },  
                    {  
                        "Name": "吴忠",  
                        "Code": "101170301"  
                    }  
                ]  
            },  
            {  
                "Province": "青海",  
                "City": [  
                    {  
                        "Name": "西宁",  
                        "Code": "101150101"  
                    },  
                    {  
                        "Name": "黄南",  
                        "Code": "101150301"  
                    },  
                    {  
                        "Name": "海北",  
                        "Code": "101150801"  
                    },  
                    {  
                        "Name": "果洛",  
                        "Code": "101150501"  
                    },  
                    {  
                        "Name": "玉树",  
                        "Code": "101150601"  
                    },  
                    {  
                        "Name": "海西",  
                        "Code": "101150701"  
                    },  
                    {  
                        "Name": "海东",  
                        "Code": "101150201"  
                    },  
                    {  
                        "Name": "海南",  
                        "Code": "101150401"  
                    }  
                ]  
            },  
            {  
                "Province": "山东",  
                "City": [  
                    {  
                        "Name": "济南",  
                        "Code": "101120101"  
                    },  
                    {  
                        "Name": "潍坊",  
                        "Code": "101120601"  
                    },  
                    {  
                        "Name": "临沂",  
                        "Code": "101120901"  
                    },  
                    {  
                        "Name": "菏泽",  
                        "Code": "101121001"  
                    },  
                    {  
                        "Name": "滨州",  
                        "Code": "101121101"  
                    },  
                    {  
                        "Name": "东营",  
                        "Code": "101121201"  
                    },  
                    {  
                        "Name": "威海",  
                        "Code": "101121301"  
                    },  
                    {  
                        "Name": "枣庄",  
                        "Code": "101121401"  
                    },  
                    {  
                        "Name": "日照",  
                        "Code": "101121501"  
                    },  
                    {  
                        "Name": "莱芜",  
                        "Code": "101121601"  
                    },  
                    {  
                        "Name": "聊城",  
                        "Code": "101121701"  
                    },  
                    {  
                        "Name": "青岛",  
                        "Code": "101120201"  
                    },  
                    {  
                        "Name": "淄博",  
                        "Code": "101120301"  
                    },  
                    {  
                        "Name": "德州",  
                        "Code": "101120401"  
                    },  
                    {  
                        "Name": "烟台",  
                        "Code": "101120501"  
                    },  
                    {  
                        "Name": "济宁",  
                        "Code": "101120701"  
                    },  
                    {  
                        "Name": "泰安",  
                        "Code": "101120801"  
                    }  
                ]  
            },  
            {  
                "Province": "陕西",  
                "City": [  
                    {  
                        "Name": "西安",  
                        "Code": "101110101"  
                    },  
                    {  
                        "Name": "延安",  
                        "Code": "101110300"  
                    },  
                    {  
                        "Name": "榆林",  
                        "Code": "101110401"  
                    },  
                    {  
                        "Name": "铜川",  
                        "Code": "101111001"  
                    },  
                    {  
                        "Name": "商洛",  
                        "Code": "101110601"  
                    },  
                    {  
                        "Name": "安康",  
                        "Code": "101110701"  
                    },  
                    {  
                        "Name": "汉中",  
                        "Code": "101110801"  
                    },  
                    {  
                        "Name": "宝鸡",  
                        "Code": "101110901"  
                    },  
                    {  
                        "Name": "咸阳",  
                        "Code": "101110200"  
                    },  
                    {  
                        "Name": "渭南",  
                        "Code": "101110501"  
                    }  
                ]  
            },  
            {  
                "Province": "山西",  
                "City": [  
                    {  
                        "Name": "太原",  
                        "Code": "101100101"  
                    },  
                    {  
                        "Name": "临汾",  
                        "Code": "101100701"  
                    },  
                    {  
                        "Name": "运城",  
                        "Code": "101100801"  
                    },  
                    {  
                        "Name": "朔州",  
                        "Code": "101100901"  
                    },  
                    {  
                        "Name": "忻州",  
                        "Code": "101101001"  
                    },  
                    {  
                        "Name": "长治",  
                        "Code": "101100501"  
                    },  
                    {  
                        "Name": "大同",  
                        "Code": "101100201"  
                    },  
                    {  
                        "Name": "阳泉",  
                        "Code": "101100301"  
                    },  
                    {  
                        "Name": "晋中",  
                        "Code": "101100401"  
                    },  
                    {  
                        "Name": "晋城",  
                        "Code": "101100601"  
                    },  
                    {  
                        "Name": "吕梁",  
                        "Code": "101101100"  
                    }  
                ]  
            },  
            {  
                "Province": "新疆",  
                "City": [  
                    {  
                        "Name": "乌鲁木齐",  
                        "Code": "101130101"  
                    },  
                    {  
                        "Name": "石河子",  
                        "Code": "101130301"  
                    },  
                    {  
                        "Name": "昌吉",  
                        "Code": "101130401"  
                    },  
                    {  
                        "Name": "吐鲁番",  
                        "Code": "101130501"  
                    },  
                    {  
                        "Name": "库尔勒",  
                        "Code": "101130601"  
                    },  
                    {  
                        "Name": "阿拉尔",  
                        "Code": "101130701"  
                    },  
                    {  
                        "Name": "阿克苏",  
                        "Code": "101130801"  
                    },  
                    {  
                        "Name": "喀什",  
                        "Code": "101130901"  
                    },  
                    {  
                        "Name": "伊宁",  
                        "Code": "101131001"  
                    },  
                    {  
                        "Name": "塔城",  
                        "Code": "101131101"  
                    },  
                    {  
                        "Name": "哈密",  
                        "Code": "101131201"  
                    },  
                    {  
                        "Name": "和田",  
                        "Code": "101131301"  
                    },  
                    {  
                        "Name": "阿勒泰",  
                        "Code": "101131401"  
                    },  
                    {  
                        "Name": "阿图什",  
                        "Code": "101131501"  
                    },  
                    {  
                        "Name": "博乐",  
                        "Code": "101131601"  
                    },  
                    {  
                        "Name": "克拉玛依",  
                        "Code": "101130201"  
                    }  
                ]  
            },  
            {  
                "Province": "西藏",  
                "City": [  
                    {  
                        "Name": "拉萨",  
                        "Code": "101140101"  
                    },  
                    {  
                        "Name": "山南",  
                        "Code": "101140301"  
                    },  
                    {  
                        "Name": "阿里",  
                        "Code": "101140701"  
                    },  
                    {  
                        "Name": "昌都",  
                        "Code": "101140501"  
                    },  
                    {  
                        "Name": "那曲",  
                        "Code": "101140601"  
                    },  
                    {  
                        "Name": "日喀则",  
                        "Code": "101140201"  
                    },  
                    {  
                        "Name": "林芝",  
                        "Code": "101140401"  
                    }  
                ]  
            },  
            {  
                "Province": "台湾",  
                "City": [  
                    {  
                        "Name": "台北县",  
                        "Code": "101340101"  
                    },  
                    {  
                        "Name": "高雄",  
                        "Code": "101340201"  
                    },  
                    {  
                        "Name": "台中",  
                        "Code": "101340401"  
                    }  
                ]  
            },  
            {  
                "Province": "海南",  
                "City": [  
                    {  
                        "Name": "海口",  
                        "Code": "101310101"  
                    },  
                    {  
                        "Name": "三亚",  
                        "Code": "101310201"  
                    },  
                    {  
                        "Name": "东方",  
                        "Code": "101310202"  
                    },  
                    {  
                        "Name": "临高",  
                        "Code": "101310203"  
                    },  
                    {  
                        "Name": "澄迈",  
                        "Code": "101310204"  
                    },  
                    {  
                        "Name": "儋州",  
                        "Code": "101310205"  
                    },  
                    {  
                        "Name": "昌江",  
                        "Code": "101310206"  
                    },  
                    {  
                        "Name": "白沙",  
                        "Code": "101310207"  
                    },  
                    {  
                        "Name": "琼中",  
                        "Code": "101310208"  
                    },  
                    {  
                        "Name": "定安",  
                        "Code": "101310209"  
                    },  
                    {  
                        "Name": "屯昌",  
                        "Code": "101310210"  
                    },  
                    {  
                        "Name": "琼海",  
                        "Code": "101310211"  
                    },  
                    {  
                        "Name": "文昌",  
                        "Code": "101310212"  
                    },  
                    {  
                        "Name": "保亭",  
                        "Code": "101310214"  
                    },  
                    {  
                        "Name": "万宁",  
                        "Code": "101310215"  
                    },  
                    {  
                        "Name": "陵水",  
                        "Code": "101310216"  
                    },  
                    {  
                        "Name": "西沙",  
                        "Code": "101310217"  
                    },  
                    {  
                        "Name": "南沙岛",  
                        "Code": "101310220"  
                    },  
                    {  
                        "Name": "乐东",  
                        "Code": "101310221"  
                    },  
                    {  
                        "Name": "五指山",  
                        "Code": "101310222"  
                    },  
                    {  
                        "Name": "琼山",  
                        "Code": "101310102"  
                    }  
                ]  
            },  
            {  
                "Province": "湖南",  
                "City": [  
                    {  
                        "Name": "长沙",  
                        "Code": "101250101"  
                    },  
                    {  
                        "Name": "株洲",  
                        "Code": "101250301"  
                    },  
                    {  
                        "Name": "衡阳",  
                        "Code": "101250401"  
                    },  
                    {  
                        "Name": "郴州",  
                        "Code": "101250501"  
                    },  
                    {  
                        "Name": "常德",  
                        "Code": "101250601"  
                    },  
                    {  
                        "Name": "益阳",  
                        "Code": "101250700"  
                    },  
                    {  
                        "Name": "娄底",  
                        "Code": "101250801"  
                    },  
                    {  
                        "Name": "邵阳",  
                        "Code": "101250901"  
                    },  
                    {  
                        "Name": "岳阳",  
                        "Code": "101251001"  
                    },  
                    {  
                        "Name": "张家界",  
                        "Code": "101251101"  
                    },  
                    {  
                        "Name": "怀化",  
                        "Code": "101251201"  
                    },  
                    {  
                        "Name": "黔阳",  
                        "Code": "101251301"  
                    },  
                    {  
                        "Name": "永州",  
                        "Code": "101251401"  
                    },  
                    {  
                        "Name": "吉首",  
                        "Code": "101251501"  
                    },  
                    {  
                        "Name": "湘潭",  
                        "Code": "101250201"  
                    }  
                ]  
            },  
            {  
                "Province": "江苏",  
                "City": [  
                    {  
                        "Name": "南京",  
                        "Code": "101190101"  
                    },  
                    {  
                        "Name": "镇江",  
                        "Code": "101190301"  
                    },  
                    {  
                        "Name": "苏州",  
                        "Code": "101190401"  
                    },  
                    {  
                        "Name": "南通",  
                        "Code": "101190501"  
                    },  
                    {  
                        "Name": "扬州",  
                        "Code": "101190601"  
                    },  
                    {  
                        "Name": "宿迁",  
                        "Code": "101191301"  
                    },  
                    {  
                        "Name": "徐州",  
                        "Code": "101190801"  
                    },  
                    {  
                        "Name": "淮安",  
                        "Code": "101190901"  
                    },  
                    {  
                        "Name": "连云港",  
                        "Code": "101191001"  
                    },  
                    {  
                        "Name": "常州",  
                        "Code": "101191101"  
                    },  
                    {  
                        "Name": "泰州",  
                        "Code": "101191201"  
                    },  
                    {  
                        "Name": "无锡",  
                        "Code": "101190201"  
                    },  
                    {  
                        "Name": "盐城",  
                        "Code": "101190701"  
                    }  
                ]  
            },  
            {  
                "Province": "黑龙江",  
                "City": [  
                    {  
                        "Name": "哈尔滨",  
                        "Code": "101050101"  
                    },  
                    {  
                        "Name": "牡丹江",  
                        "Code": "101050301"  
                    },  
                    {  
                        "Name": "佳木斯",  
                        "Code": "101050401"  
                    },  
                    {  
                        "Name": "绥化",  
                        "Code": "101050501"  
                    },  
                    {  
                        "Name": "黑河",  
                        "Code": "101050601"  
                    },  
                    {  
                        "Name": "双鸭山",  
                        "Code": "101051301"  
                    },  
                    {  
                        "Name": "伊春",  
                        "Code": "101050801"  
                    },  
                    {  
                        "Name": "大庆",  
                        "Code": "101050901"  
                    },  
                    {  
                        "Name": "七台河",  
                        "Code": "101051002"  
                    },  
                    {  
                        "Name": "鸡西",  
                        "Code": "101051101"  
                    },  
                    {  
                        "Name": "鹤岗",  
                        "Code": "101051201"  
                    },  
                    {  
                        "Name": "齐齐哈尔",  
                        "Code": "101050201"  
                    },  
                    {  
                        "Name": "大兴安岭",  
                        "Code": "101050701"  
                    }  
                ]  
            },  
            {  
                "Province": "吉林",  
                "City": [  
                    {  
                        "Name": "长春",  
                        "Code": "101060101"  
                    },  
                    {  
                        "Name": "延吉",  
                        "Code": "101060301"  
                    },  
                    {  
                        "Name": "四平",  
                        "Code": "101060401"  
                    },  
                    {  
                        "Name": "白山",  
                        "Code": "101060901"  
                    },  
                    {  
                        "Name": "白城",  
                        "Code": "101060601"  
                    },  
                    {  
                        "Name": "辽源",  
                        "Code": "101060701"  
                    },  
                    {  
                        "Name": "松原",  
                        "Code": "101060801"  
                    },  
                    {  
                        "Name": "吉林",  
                        "Code": "101060201"  
                    },  
                    {  
                        "Name": "通化",  
                        "Code": "101060501"  
                    }  
                ]  
            },  
            {  
                "Province": "辽宁",  
                "City": [  
                    {  
                        "Name": "沈阳",  
                        "Code": "101070101"  
                    },  
                    {  
                        "Name": "鞍山",  
                        "Code": "101070301"  
                    },  
                    {  
                        "Name": "抚顺",  
                        "Code": "101070401"  
                    },  
                    {  
                        "Name": "本溪",  
                        "Code": "101070501"  
                    },  
                    {  
                        "Name": "丹东",  
                        "Code": "101070601"  
                    },  
                    {  
                        "Name": "葫芦岛",  
                        "Code": "101071401"  
                    },  
                    {  
                        "Name": "营口",  
                        "Code": "101070801"  
                    },  
                    {  
                        "Name": "阜新",  
                        "Code": "101070901"  
                    },  
                    {  
                        "Name": "辽阳",  
                        "Code": "101071001"  
                    },  
                    {  
                        "Name": "铁岭",  
                        "Code": "101071101"  
                    },  
                    {  
                        "Name": "朝阳",  
                        "Code": "101071201"  
                    },  
                    {  
                        "Name": "盘锦",  
                        "Code": "101071301"  
                    },  
                    {  
                        "Name": "大连",  
                        "Code": "101070201"  
                    },  
                    {  
                        "Name": "锦州",  
                        "Code": "101070701"  
                    }  
                ]  
            }  
        ]  
    }  